
[{"id":"36141501","userName":"Apurva Gaur","rating":5,"rating_5":"4.5000","reviewText":"The most amazing ambience and extremely good service provided by this cafe. The staff was cordial and welcoming. The food was super amazing and delicious. In near cyber hub, this plafe is a must must visit. ","reviewTime":"2018-06-11 12:53:46","reviewTimeFriendly":"2 hours ago","timestamp":1528701826,"ratingColor":"3F7E00"},{"id":"36103024","userName":"Pastaloverboy","rating":5,"rating_5":"5.0000","reviewText":"Love farzi cafe and cant talk enough about it\nThe food is amazing and worth the hype\nEverything from the drinks to the desserts will\nImpress you\nTry the chuski margarita and the parle g cheese cake","reviewTime":"2018-06-10 13:16:16","reviewTimeFriendly":"yesterday","timestamp":1528616776,"ratingColor":"305D02"},{"id":"36098631","userName":"Janvhi Oberai","rating":1,"rating_5":"1.0000","reviewText":"I am giving you feedback\nI tried fish it was dry and no taste.\nI tried chicken it is not worth mentioning.\nI ordered mutton and malabari paratha,mutton was full of salt and malabari paratha just reheated paratha.\nI ordered desi chowmin,no taste and full of salt.\nThis whole experience was awfull.\nIt was total waste of money.","reviewTime":"2018-06-10 10:11:31","reviewTimeFriendly":"yesterday","timestamp":1528605691,"ratingColor":"CB202D"},{"id":"36076665","userName":"AmaliaNoelle","rating":5,"rating_5":"5.0000","reviewText":"Food glorious food is all I will say about Farzi Cafe. It's a welcome attack on your senses. One is left with an orgasmic high after savouring all dishes. Each one of them is down to details with the flavours so apparent the moment the cutlery hits your mouth. From their appetisers to the main course to the desert. One is just begging for the gastronomy not to stop. It's not heavy at all and just about the right portion size. The one at DFL Cyber Hub hit the ball out of the park for sure. It's time to visit the Mumbai one to see if this outlet lives up to my expectations. ","reviewTime":"2018-06-09 18:26:05","reviewTimeFriendly":"yesterday","timestamp":1528548965,"ratingColor":"305D02"},{"id":"36069319","userName":"Souman Sh","rating":4,"rating_5":"4.0000","reviewText":"Good Food with Indian Fusion. Good Place to have your Dinner, Some dishes were very good! Ordered lot of chicken stuff and i was not disappointed with any of them.Would love to come again.","reviewTime":"2018-06-09 14:44:45","reviewTimeFriendly":"2 days ago","timestamp":1528535685,"ratingColor":"5BA829"},{"id":"36019883","userName":"Vishesh Monga","rating":5,"rating_5":"5.0000","reviewText":"Farzi Experience is always a memorable one. This was my first visit to the cyber hub outlet and I really enjoyed it. Inspite of multiple visits to farzi I still haven't tried even half the menu. Yet I had a few existing favourites and the number only increased.\nSo there are few dishes that no one does better than them, such as:\n&gt;Farzi Fried Chicken&nbsp;\nOh my god! These chicken wings are to die for. Chilly marination and the perfect crust make these a must have,\n&gt; Gupta Burger\nYou are likely to develop a taste for the Gupta Burger of Delhi, if you have the one at Farzi.\n&gt;Tempura Prawns\nHands down the best. Japanese restaurants, please up your game.\n\nOthers may not be the best but were still very very good:\n&gt;Amrisari Fish\n&gt;Lamb Shanks\n&gt; Raw Papaya Salad\n\nP.S. Their potato wedges are different and very tasty and almost killed my appetite.","reviewTime":"2018-06-07 21:09:43","reviewTimeFriendly":"4 days ago","timestamp":1528385983,"ratingColor":"305D02"},{"id":"36017760","userName":"Prerna","rating":4,"rating_5":"4.0000","reviewText":"This cafe is super farzi(in a good way ofcourse).\nI will start with saying that i absolutely hate fusion food but this place changed my opinion.I enjoyed everything we ordered and tastes were up to the mark.The place is high end and prices are accordingly but tastes were up to the mark.Raj kachouri was a bit weird to taste but else everything was pretty good.\nTo highlight we got mishtidoi shots in the beginning and unusually made sugar candy pans in the end.\nI loved it!!!\nThis place is worth a visit for both vegetarians and non vegetarians.","reviewTime":"2018-06-07 20:10:16","reviewTimeFriendly":"4 days ago","timestamp":1528382416,"ratingColor":"5BA829"},{"id":"36007855","userName":"Sumeet Rana","rating":4,"rating_5":"4.0000","reviewText":"Pros\n-Great Ambiance\n-Fast service\n-Presentation\n\nCons\n-Not value for money\n\nNam farzi hai Lekin kahna asli tha Lekin bill zyda ata hai ... Over priced ","reviewTime":"2018-06-07 13:58:36","reviewTimeFriendly":"4 days ago","timestamp":1528360116,"ratingColor":"5BA829"},{"id":"35992760","userName":"Shivam Satyam","rating":5,"rating_5":"5.0000","reviewText":"A creative list of cuisines and equally modest service. Great for corporate times, classy dineouts and brief conversations.\nImpressive theme.\n~finedine","reviewTime":"2018-06-06 21:00:05","reviewTimeFriendly":"5 days ago","timestamp":1528299005,"ratingColor":"305D02"},{"id":"35992397","userName":"Sandipan Roy","rating":5,"rating_5":"5.0000","reviewText":"My first experience was awesome, spectacular . One of the best place to hangout. Simply love the ambience and services. Full marks on service. Food taste is good. Music was soothing and appropriate. Best place to hangout","reviewTime":"2018-06-06 20:51:43","reviewTimeFriendly":"5 days ago","timestamp":1528298503,"ratingColor":"305D02"},{"id":"35963761","userName":"Nishant","rating":5,"rating_5":"5.0000","reviewText":"Thanks to the lovely ambience and hospitality rendered by one of their Bar Attendees Vishal. He served really quick and flawlessly. \nGreat service. Hope to see you soon. 😊","reviewTime":"2018-06-05 20:09:44","reviewTimeFriendly":"6 days ago","timestamp":1528209584,"ratingColor":"305D02"},{"id":"35949132","userName":"Mohitmkkr","rating":5,"rating_5":"5.0000","reviewText":"Good menu. Great complementary appetisers. Excellent post meal sweets. Thanks @Rohit for the good service. Just make the duck dishes available. \n","reviewTime":"2018-06-05 03:58:57","reviewTimeFriendly":"6 days ago","timestamp":1528151337,"ratingColor":"305D02"},{"id":"35947207","userName":"Rohit Gupta","rating":3,"rating_5":"3.0000","reviewText":"Farzi cafe is known for &ldquo;farzifying&rdquo; the famous dishes which I really like, looking things from a different perspective.\nHave been to this place quite a number of times now and I must say the &ldquo;farzipan&rdquo; is good.\nThe complimentary strawberry yogurt popper was amazing which had our hopes high. \nWe ordered kachori and vada pav starter. For drinks, we ordered litchi Aam panna. The kachori and vada pav were definitely twisted but not to the extent I was expecting. It was actually very subtle and nearly non-noticeable twist. Drink was a real letdown and couldn&rsquo;t finish it. I could taste packed litchi juice. There was no freshness and it was very sweet.\nFor dessert we ordered Parle-G cheesecake and it was way too sweet and this is coming from a person who loves desserts.\nService was also not up to the mark. Drinks were taking time, had to remind couple of times to the staff what we ordered and the service overall was very normal. This wouldn&rsquo;t have been an issue if we were not charged premium prices.","reviewTime":"2018-06-05 00:34:11","reviewTimeFriendly":"7 days ago","timestamp":1528139051,"ratingColor":"CDD614"},{"id":"35926831","userName":"Ac4081687","rating":4,"rating_5":"4.0000","reviewText":"good experince in farzi cafe,food was good and drinks taste was great with some different flavours.Ambince was good and lots of rush in weekend ..","reviewTime":"2018-06-04 12:30:13","reviewTimeFriendly":"7 days ago","timestamp":1528095613,"ratingColor":"5BA829"},{"id":"35922542","userName":"Amit Gupta","rating":5,"rating_5":"5.0000","reviewText":"Wonderful place made our date night even better with helpful staff especially Rohit. We really had a lovely experience there.\nHow on earth anyone would think of serving Daal-Chaawal any different way than what one would have had since childhood, but Farzi Cafe served an amazing dish out of Daal-Chaawal, thanks Rohit for recommending that, I shall visit next Just to have that for sure.","reviewTime":"2018-06-04 03:29:05","reviewTimeFriendly":"7 days ago","timestamp":1528063145,"ratingColor":"305D02"},{"id":"35920439","userName":"Sourav Joshi","rating":5,"rating_5":"5.0000","reviewText":"Farzi cafe is the best fusion food restaurant Delhi NCR has.\n\nThe whole ambiance, the service, the food and the drinks are mind blowing.\n\nThe place is so beautifully done up that it adds in multifolds to the whole experience.\n\nI had a number of cocktails and loved each and every of them.\n\nThe prawns, Aranchini, the chicken tikka masala, fish tikka everything was so so good. Can&rsquo;t put in words how wonderful it was. What a lovely experience.","reviewTime":"2018-06-04 00:37:14","reviewTimeFriendly":"8 days ago","timestamp":1528052834,"ratingColor":"305D02"},{"id":"35909997","userName":"Apurva Giri","rating":5,"rating_5":"5.0000","reviewText":"Very good food and ambiance. Starters were fantastic. Good suggestions and mocktails. Mr. vishal did a good job. Had an amazing time here and would come back soon. ","reviewTime":"2018-06-03 21:06:55","reviewTimeFriendly":"8 days ago","timestamp":1528040215,"ratingColor":"305D02"},{"id":"35896282","userName":"Kirti Mukharji","rating":5,"rating_5":"5.0000","reviewText":"Farzi cafe is the best place for party.\nI have been go their for party with my 2 friends.\nAnd we ordered drinks and snacks. The drinks are perfect and snacks was delicious.\nStaff was well behaved.\nOverall we had an amazing experience.","reviewTime":"2018-06-03 15:16:57","reviewTimeFriendly":"8 days ago","timestamp":1528019217,"ratingColor":"305D02"},{"id":"35891340","userName":"Phalguni Bhatia","rating":4,"rating_5":"4.0000","reviewText":"Let me put it in a simple sentence, Some things worked and some didn't!\nWhat worked?\nThe gol gappa platter: Good quantity for its price!\nNizami Biryani: One of my favourites here!\nFenni Nest and Chenna Balls: A Must try, it's as delicious as it looks.\nWhat to skip?\nChocolate Dirt Pile: It looked amazing, It was presented beautifully, but it was too bad for the price. Save yourself those 525 bucks and thank me later.\nDal Moth Chat: Too basic.\nYou can follow me on savourtheflavour_delhi for detailed review.\n","reviewTime":"2018-06-03 13:27:42","reviewTimeFriendly":"8 days ago","timestamp":1528012662,"ratingColor":"5BA829"},{"id":"35886311","userName":"Gaurav Anand","rating":5,"rating_5":"5.0000","reviewText":"Visited on my birthday and what a pleasant surprise it was. Rohit smittened us with his service, smile, and suggestions!! A surprise sweetish cum cake was also provided complimentary with a smile. Will definitely go back there!!","reviewTime":"2018-06-03 09:21:52","reviewTimeFriendly":"8 days ago","timestamp":1527997912,"ratingColor":"305D02"},{"id":"35883664","userName":"Khushbooagarwal10294","rating":4,"rating_5":"4.0000","reviewText":"Farzi cafe, as the name suggests, is a place where you will get the quirkiest dishes farzified in some or the other way! I loved their service. They serve you amuse- bouche before your meals which increases your appetite and end your meal with a candy floss paan. The ambience of this place is really good. Whereas, food is on the average side. I loved their litchi aam panna desire which was a perfect blend of that &ldquo;khatta meetha flavour&rdquo; and is a must try for the people who don&rsquo;t consume alcohol!!","reviewTime":"2018-06-03 02:26:26","reviewTimeFriendly":"9 days ago","timestamp":1527972986,"ratingColor":"5BA829"},{"id":"35880177","userName":"Surajit Chaudhuri","rating":5,"rating_5":"5.0000","reviewText":"Our experience here has been Amazing .Food here was excellent . Interesting dishes blended together with good music and DJ . The service level was also good .Special thanks to Vishal for making our visit memorable .","reviewTime":"2018-06-02 23:41:42","reviewTimeFriendly":"9 days ago","timestamp":1527963102,"ratingColor":"305D02"},{"id":"35845839","userName":"Anuj Vadehra","rating":5,"rating_5":"5.0000","reviewText":"Had an amazing service from Roshan. Vishal, Subodh and Dhuri Charan were there to assist us during our visit. We had ordered dal chawal Arincini and Guntur Chilli Chicken. Would definitely like to visit here again.\n","reviewTime":"2018-06-01 23:10:59","reviewTimeFriendly":"10 days ago","timestamp":1527874859,"ratingColor":"305D02"},{"id":"35845735","userName":"Udit Singhal","rating":5,"rating_5":"5.0000","reviewText":"Had a great time on a Friday night with my friends. Staff was courteous and great service. Thanks to Roshan, Subodh, Vishal and Dhunrichan . \nKeep Rocking  Farzi Cafe🍻","reviewTime":"2018-06-01 23:08:55","reviewTimeFriendly":"10 days ago","timestamp":1527874735,"ratingColor":"305D02"},{"id":"35844853","userName":"Shobhit Lohia","rating":1,"rating_5":"1.0000","reviewText":"This place is a dining set up but they confuse themselves with a clubbing scene. Service is slow and poor. Food is good . Please go during lunch time and definitely not for dinner.\n\nOverall experience very bad. Please avoid this place ","reviewTime":"2018-06-01 22:50:29","reviewTimeFriendly":"10 days ago","timestamp":1527873629,"ratingColor":"CB202D"},{"id":"35844623","userName":"Particle Sho","rating":5,"rating_5":"5.0000","reviewText":"This is an amazing place to visit. They have a different concept when it comes to presenting their food. It is so entertaining and yet the flavors can make you tingle just a little.\nThe food is really good, the drinks are nice, the service is awesome.&nbsp;\nPerfect Bar and Restaurant made for the Hip and upcoming generation.\n\nI am pretty certain when I say that this place is here to stay, people will return to it again and again, I myself have visited here 4 times already and sent countless friends.\n\nI loved the food, it was very tasty, I loved the way it came in that amazing plate, ohh man I love the mouth refreshment they gave after the food, the mint, it was rolled in cotton candy. Oh my god what was that. I loved it, I am delighted of every second I have spent here and every penny.\n\nNot often I say this, but it is deserving of the price they are asking for their food.","reviewTime":"2018-06-01 22:45:42","reviewTimeFriendly":"10 days ago","timestamp":1527873342,"ratingColor":"305D02"},{"id":"35842493","userName":"Decadenz || SIN IS IN","rating":4,"rating_5":"4.0000","reviewText":"#SINISIN Diaries\n\nA gourmand's delight this place! Authentic preparations with one of the best presentations. Portion sizes a tad disappointing though.","reviewTime":"2018-06-01 22:01:13","reviewTimeFriendly":"10 days ago","timestamp":1527870673,"ratingColor":"5BA829"},{"id":"35840865","userName":"Shashank Misra","rating":5,"rating_5":"5.0000","reviewText":"Roshan, Sanjeev, Amit and sunny - the top 4 bartenders in cyberhub. If you need a good cocktail and nice food go with their recommendations. Had Vada Pao which reminded me of my time in Mumbai. ","reviewTime":"2018-06-01 21:27:36","reviewTimeFriendly":"10 days ago","timestamp":1527868656,"ratingColor":"305D02"},{"id":"35814448","userName":"Jyoti Raghuvanshi","rating":4,"rating_5":"4.0000","reviewText":"Farzi Cafe is an experience and it is known as the best Indian fusion restaurants in Delhi NCR. Visited this place last Saturday with Vivek and had a great time. The place is huge and it was brilliantly designed from outside &amp; inside. The place has classy ambiance with light music in the background.\n\nDuring our visit, we ordered Raw Mango Papaya Salad, Cream Corn Chowder Soup, Farzified mezze platter with desi twist, Matka Choley with Lucchi puff. The food quality is nice and it tastes well.\n\nIn drinks, we had Litchi Panna Desire and Three Mosquetiers. The drinks are very good.\n\nIn dessert, we had Chocolate Dirt Pile and it tastes amazing.\n\nTalking about Service, it was impeccable, and you'll be surprised by the knowledge of the staff.\n\nAfter finishing the Appetizers, you'll be served with a tangy lollipop, it will clean the palate before the main course served to you. Once you finished the dessert you'll be served with a complimentary Paan, it's a cotton pan and chocolate dessert.\n\nOverall, loved their fusion food. Visiting this place soon.","reviewTime":"2018-05-31 23:39:01","reviewTimeFriendly":"11 days ago","timestamp":1527790141,"ratingColor":"5BA829"},{"id":"35813116","userName":"Vivek Parmar","rating":5,"rating_5":"5.0000","reviewText":"Farzi Cafe located in DLF Cyber Hub, Gurgaon, and the nearest metro station is IndusInd Bank. The Farzi Cafe is an experience and the concept is delightful &amp; aesthetically pleasing. It is touted as one of the best Indian fusion restaurants, and on my bucket list for a long time. Finally, got the time to visit here with Jyoti Raghuvanshi.\n\nThe place is brilliantly designed &amp; curated and you can experience it from outside entrance, the place has rustic look from outside and contemporary look from inside with dim light. The place is huge and has classy ambiance with light music in the background. The Sitting area is spacious.\n\nThey have a wide variety of menu and the talented Chef Tanvi suggested us dishes as per our taste &amp; liking. She also guided us throughout the dining experience and explained the method of preparation. From the complimentary welcome dish - Mishti Doi Bubble, everything on their menu is mesmerizing and during our visit, we had Raw Mango Papaya Salad, Cream Corn Chowder Soup, Farzified mezze platter with desi twist, Chicken Tikka Cigar, Matka Choley with Lucchi puff, Dum Dahi Murg, Mutton Rahi Pepper Fry with Malabari Parantha.&nbsp; The flavor of the food is good and the innovative dishes served in a unique way. According to me, this is a great place to have modern Indian snacks and have no comparison.\n\nIn drinks, we had Farzi Apple Foamartini, Litchi Panna Desire, and Three Mosquetiers. The drinks are very good.\n\nIn dessert, we had Chocolate Dirt Pile, a combination of jaggery, sugar, chocolate, chilly ganache, truffle, chocolate powder and then finally all mixed with chocolate syrup.\n\nTalking about Service, it was impeccable. Liked the courtesy &amp; politeness of the staff. Above all, you'll be surprised by the knowledge of the staff.\n\nAs soon as you done up with Appetizers, you'll be served with a tangy lollipop, it will clean the palate before the main course so that you will enjoy the best of both worlds.\n\nIf you think you just done up, you will be served with a complimentary Paan. The Paan comes in a beautiful box and wrapped so beautifully. Basically, it's a cotton pan and chocolate dessert.\n\nOverall, loved the experience at Farzi Cafe and their fusion food.","reviewTime":"2018-05-31 23:18:18","reviewTimeFriendly":"11 days ago","timestamp":1527788898,"ratingColor":"305D02"},{"id":"35803069","userName":"Shlok Kamat","rating":5,"rating_5":"5.0000","reviewText":"This is by far my favorite restaurant in all of gurgaon. I love the selection of wines as well as the drinks and the food in here. I would like to see bands performing earlier isle about 8 in the evening . Love the food and the service","reviewTime":"2018-05-31 20:22:43","reviewTimeFriendly":"11 days ago","timestamp":1527778363,"ratingColor":"305D02"},{"id":"35786997","userName":"Ravi Yadav","rating":4,"rating_5":"4.0000","reviewText":"Visited Farzi cafe last month, had a get together with IIM Bangalore friends! \nOrdered vada Pao, tandoori wild mushrooms and tandoori soy chaps with lemonade! \nFood- liked the food, although finding something you may like was but difficult as Menu is confusing and non-structured! If you have time to appreciate the art of writing then it is fine otherwise it takes time in figuring out what to order for first time visitors. \nService- service is good. Would rate 4\/5 in service. \nGiven the high price point felt like food was just average but it got changed with the complimentary Paan serving. I liked that the most, comes in a beautiful box and wrapped so beautifully! \nAmbience was good. \nWould rate 4\/5 overall.","reviewTime":"2018-05-31 11:27:56","reviewTimeFriendly":"11 days ago","timestamp":1527746276,"ratingColor":"5BA829"},{"id":"35775222","userName":"Maimie Powell","rating":5,"rating_5":"5.0000","reviewText":"Vishal was amazing with his service awesome food and drinks and the dry ice was really cool and good music awesome place awesome people .....................................","reviewTime":"2018-05-30 21:49:56","reviewTimeFriendly":"12 days ago","timestamp":1527697196,"ratingColor":"305D02"},{"id":"35773928","userName":"Shubheksha.singh","rating":5,"rating_5":"5.0000","reviewText":"This cafe is brilliantly designed and curated ! \nThe fusion food is amazing and the ambience is very different ! They way they serve their food is unique which makes the food even more tempting to have ! \nFood we had -\n&bull;Cheese balls- They were cheesy ofcourse and crispy outside . \n&bull;Chicken tikka masala- Is one of the most recommended dishes and you&rsquo;ll know that only when you try it ! so do so. \n&bull;Parle G cheesecake desert -💯\n\nFood-5\/5\nPrice-3\/5 as its a bit pricey\nAmbi-5\/5\n\nTry it !!! ","reviewTime":"2018-05-30 21:23:50","reviewTimeFriendly":"12 days ago","timestamp":1527695630,"ratingColor":"305D02"},{"id":"35769449","userName":"AT","rating":5,"rating_5":"5.0000","reviewText":"The ambience n food complement each other. Cocktail martini chuski is really worth tryinng.Non veg.dishes made n served differently really deserve appreciation..Sitting area is spacious.Would recommend.","reviewTime":"2018-05-30 19:28:53","reviewTimeFriendly":"12 days ago","timestamp":1527688733,"ratingColor":"305D02"},{"id":"35759242","userName":"Noopur","rating":5,"rating_5":"5.0000","reviewText":"Farzi cafe is not a restaurant but an experience. They have such unique ways of presentation and such innovative dishes that you get spell bound in just a few moments. From the complementary welcome dish - Mishti Doi Bubble, the froth on top of the Shrimp, to the oh-so-awesome Phirni Nitrate, everything on their menu is mesmerising. Also the flavour of the food is as good as its presentation, which must be applauded, especially the Gaulawat Kebab Burger. Loved the experience and can&rsquo;t wait to go back again.","reviewTime":"2018-05-30 13:33:30","reviewTimeFriendly":"12 days ago","timestamp":1527667410,"ratingColor":"305D02"},{"id":"35758418","userName":"Romi Dabas","rating":4,"rating_5":"4.0000","reviewText":"Recently visited Farzi cafe in cyberhub. The place has a nice ambiance to chill with friends and family. \nI tried few things like, \nRatatouille Gujia - This was green veggies filled gujia with masala and some chips. The imli chutney complimented quite well. \nMushroom falafel Doner - This was nothing exceptional. Crunchy Mushroom patty with vegetables. \nFalafel platter - This was okayish. Nothing really great. \nPosh maggi - Maggi with truffle oil and mushroom. Mild spices. \nCaesar Salad with pulled chicken - The pulled chicken and half fried egg over the salad. Quite a new type of salad\n\nThe staff was not attentive. With almost average food and few great drinks, the experience was not too good.","reviewTime":"2018-05-30 13:01:17","reviewTimeFriendly":"12 days ago","timestamp":1527665477,"ratingColor":"5BA829"},{"id":"35740873","userName":"S@g@r","rating":5,"rating_5":"5.0000","reviewText":"The beauty lies within the the eyes of the viewer, but this ascetics beauty is beyond fathomable austerity.\n\nFrom the an amazing outside entrance to rustic and concomitantly contemporary look from inside,\n\nFrom a fusion food to hybrid palette to a satiafied patron walking out those doors with an intent to return again for a memorable time,\n\nFrom an extremely talented Chef Tanvi maam to very amicable, swift and with a knowledge of there product inside out, the staff is impressive and suave on its most subtle way,\n\nFrom dishes that sounds or tastes eccentric and unusual to a degree of amazement and the sense of delicacies all over the tongue and mind is what this place is all about.\n\nI ordered a lot of things, in drinks we had;\n1. Farzi OK\n2. margherita chuski\n3. chai cocktail\n\nFor starters we had\n1. chicken tikka caramelized onion cigar \/ jack fruit veg cigars as well\n2. Guntur chilly chicken\n3. cheese and veggues stuffed gunjia with waffers\n4. farzifued mezze platter with desi twist (highly recommended)\n5. green papaya salad\n\nFor mains we had;\n1. mushroom falafel donner\n2. soya tikka (tasty to a limit to invoke a frenzy in you)\n3. mutton seekh with cheese cream filling\n4. malai kofta with gravy and bread\n\nfinal for desserts we had\n1. chooclate mess (jaggery, sugar, chooclate, chilly ganache, truffle, chooclate powder and then finally all mixed with chocolate syrup) imagine the taste and ita after effect.\n2. Ras malai and carrot cake with sugar moulds\n\nLoved it.","reviewTime":"2018-05-29 19:23:45","reviewTimeFriendly":"13 days ago","timestamp":1527602025,"ratingColor":"305D02"},{"id":"35718135","userName":"Priyanka Mehta","rating":3,"rating_5":"3.0000","reviewText":"Farzi cafe is a good place to drop into for a relaxing weekend. It was on my bucket list from long time. I finally dropped there this weekend with my friends. \nAmbience here was good with light music in the background. \nComing to the food items ordered:\nDrinks\n~Farzi Ok : This was like lemon flavour, very refreshing drink.\nFood items:\n~ Daal chawal Arancini : Good taste. You can try it once.\n~ Veg cheese gunjia : These were cheese rolls. Worth the try.\n\nOverall an average experience.","reviewTime":"2018-05-28 21:24:43","reviewTimeFriendly":"14 days ago","timestamp":1527522883,"ratingColor":"CDD614"},{"id":"35701973","userName":"Vinay Kumar","rating":5,"rating_5":"5.0000","reviewText":"The last Sunday I was there for my bday celebration with my friend's and it was the awesome experience right there.\n\nThe service was very good 👍 we all enjoyed chicken Tikka ,paneer Tikka , mushroom, grilled chicken, vodka and chilled beer 🍺.\n\nIt was the first experience of me for that kind of night life I would like to thanks to staff of farzi cafe specially a man whose name Rohit had well enjoyed with us and support us\n\nThey give a special complimentary chotu cake 🧀and after that a PAN 🥟","reviewTime":"2018-05-28 10:38:28","reviewTimeFriendly":"14 days ago","timestamp":1527484108,"ratingColor":"305D02"},{"id":"35671689","userName":"Rachnadesk","rating":4,"rating_5":"4.0000","reviewText":"Great food and experience . Vishal who served us was outstanding.  Must visit farzi and experience the new menu. Harleen risotto and irachi mutton were outstanding ","reviewTime":"2018-05-27 15:00:27","reviewTimeFriendly":"15 days ago","timestamp":1527413427,"ratingColor":"5BA829"},{"id":"35663342","userName":"साहिल मरहट्टा","rating":5,"rating_5":"5.0000","reviewText":"Chilly Prawns were yum 《●》\nThe best thing about this place: It was not overcrowded and the mild music suited the ambience.\n\nRed wine Sangria has always been my favourite and what we got there was amazing blend of taste that one seeks from a well made Sangria.\n\nThe rest of the food that we ordered was equally yum and the *Chicken Tikka* was really praised by one of our Romanian colleague. &quot;It was the best chicken tikka he had tasted so far&quot;.\n\nAt last, the Beers were chilled and the Service 0ffered was excellent.\n\nCheers Guys!!\nLooking forward to visit again soon. ;)\n","reviewTime":"2018-05-27 10:52:21","reviewTimeFriendly":"15 days ago","timestamp":1527398541,"ratingColor":"305D02"},{"id":"35629994","userName":"Rajiv","rating":5,"rating_5":"5.0000","reviewText":"This is great place to have modern Indian snacks . They have redone beautifully the snacks and the taste is amazing . Typically I don&rsquo;t go out for Indian food but if I have to , with my parents and all , this is the place I end up at. Not a fan of main course at this place . Wine and drinks are decent as well . ","reviewTime":"2018-05-26 10:46:15","reviewTimeFriendly":"16 days ago","timestamp":1527311775,"ratingColor":"305D02"},{"id":"35599037","userName":"Alannah Pinto","rating":4,"rating_5":"4.0000","reviewText":"it was a really wonderful experience.. liked the courtesy and politiness of the staff that catered to our table (MR. Rohit)... and the food was really good","reviewTime":"2018-05-25 01:42:41","reviewTimeFriendly":"18 days ago","timestamp":1527192761,"ratingColor":"5BA829"},{"id":"35598289","userName":"Simran Dhameja | Cravingsandcalories","rating":5,"rating_5":"5.0000","reviewText":"Farzi Cafe was on my bucket list since almost more than 1 year and finally I went to this place last weekend . The ambience here is classy and elegant with some amazing modernised presentation and experiments of food. \n\nDrinks - \n1. Farzi Ok \n2. Drink on highway \n3. Margarita Chuski \n- All the three drinks were amazing!\n\nFood -\n1. Corn Chowder Soup \n2.Dal Chawal Aranchini\n3. Mushroom Falafel \n4. Veg cheese gunjia \n5. Mutton Rolls \n- I loved mushroom falafel and veg gunjia&rsquo;s too , they were lip-smacking \n\nMains -Chicken Curry with Biryani and Lachha parantha , the curry was so flavoursome . It tasted more yummy with Biryani :*\n\nHad their cotton paan and chocolate dessert , of which I even forgot the name :p \n\nBut the experience was very much memorable and scrumptious here . \n\n","reviewTime":"2018-05-25 00:45:02","reviewTimeFriendly":"18 days ago","timestamp":1527189302,"ratingColor":"305D02"},{"id":"35592574","userName":"Amayraa Yadav","rating":5,"rating_5":"5.0000","reviewText":"Awesome place , food just have no comparison . The dishes are awesome in taste . I loved the jackfruit cigar :) Rohit we&rsquo;re so helpful to understand what is best here in food as well as in drinks . Thanks Rohit :) \nI will surely gonna visit again ;) \nU too guys :) try that out and write me your feedback ","reviewTime":"2018-05-24 21:46:40","reviewTimeFriendly":"18 days ago","timestamp":1527178600,"ratingColor":"305D02"},{"id":"35553804","userName":"Divya Joshi","rating":5,"rating_5":"5.0000","reviewText":"Farzi cafe is one of my most favourite joints in cyber hub!\n\nIt&rsquo;s classy yet it&rsquo;s accessible. The modest indo western fusion food is the highlight.\n\nThe ambiance, the service, the drinks, the food - all are awesome !\n\nThe food being the most important part of any eatery- it nailed it. Awesome and best food.\n\nStarting from the corn chowder soup- I had it for the first time and absolutely loved it.\n\nThe daal chawal Arichini- a signature dish and it deserves all the compliments it gets.\n\nChicken tikka in tahini marinate- awesome .. this was a new and a wonderful dish.\n\nThe mushroom falafel- loved the whole concept of pita with everything on it and topped with a mushroom falafel and then roll it and eat it.\n\nChicken Chettinad gujiya- loved the flavours, the presentation, the whole feel of the the dish! It&rsquo;s so good that I could eat it all day.\n\nCholey lucchi - what a wonderful combination. The Choley was so delicious, we loved it.\n\nThe chicken tikka masala- it&rsquo;s their signature dish and served with style in a Uk phone booth, representing the hit dish of UK.\n\nParleyG cheesecake- this looked pretty but didn&rsquo;t taste that great.\n\nDrinks- farzi ok- awesome drink.\nLitchi panna- again amazing drink.\nStrawberry lemonade- fresh and delicious.\n\nA wonderful place with a great experience.","reviewTime":"2018-05-23 13:53:38","reviewTimeFriendly":"19 days ago","timestamp":1527063818,"ratingColor":"305D02"},{"id":"35543883","userName":"Rushikesh Nawathe","rating":5,"rating_5":"5.0000","reviewText":"The concept is delightful and aesthetically pleasing. Food was above par. 10\/10 would visit again. Special mention to Rohit and Manish for wonderful hospitality.","reviewTime":"2018-05-22 22:30:30","reviewTimeFriendly":"20 days ago","timestamp":1527008430,"ratingColor":"305D02"},{"id":"35533048","userName":"Prodiscern","rating":5,"rating_5":"5.0000","reviewText":"Farzi is one of the first and the best Indian fusion restaurant! \n\nThe ambience is amazing.. it&rsquo;s huge and so well made. \n\nThe service is quick and responsive. \n\nThe drinks are very good- specially the farzi ok. \n\nThe food- here comes the best of the best part of farzi. \n\nStarted with the corn chowder soup- so my mum is a fussy eater and has very limited and peculiar taste buds, she loved the soup and it&rsquo;s a winner for us. \n\nChicken Chettinad gujiya- what an amazing dish it was.. truly fabulous. The inji chutney with it was also very good. \n\nDaal chawal arinchini- a true Indian fusion, again a hit in the table of my family members. \n\nMushroom falafel- this was also very good. \n\nMurgh tahini tikka- this was fabulous ! The tahini paste marination was so good in it. \n\nRajasthani Kadhi chawal- a heap of rice decorated with batter fried onion rings and a batter fried gree chilli with Rajasthani onion kadhi to be poured on top. \nMy mother devoured this delight. It is a must order. \n\nFarzi special chicken tikka masala- the presentation of it was superb. They served it in a London style telephone booth, since they said that it&rsquo;s London&rsquo;s farzis  national dish. The taste was mind blowing !\n\nCholey with lucchi poori- oh so good.. very very good. Loved It. \n\nThe dessert- parley G cheesecake- it was unique and nice. \n\nAll in all a fabulous place .. the food is great and so is the whole experience.","reviewTime":"2018-05-22 15:56:53","reviewTimeFriendly":"20 days ago","timestamp":1526984813,"ratingColor":"305D02"},{"id":"35522759","userName":"Desi Habshi","rating":5,"rating_5":"5.0000","reviewText":"Fusion at it's best! That's how I can simply define Farzi Cafe. It's already a sensation now. I really wonder whether my review is even needed now as the elitists are already loyal patrons and hooked to this laboratory which excels and stands apart in molecular gastronomy!\n\nWe visited recently, on a Monday evening and as expected, it was packed with food lovers and only 2 or 3 tables were vacant!\n\nThe ambience is classy and the cafe is dim lit which is the perfect setting to enjoy a peaceful dinner. But, the downside is that one can never get good pictures in such low lighting!\n\nThey have a huge and lavish menu but as suggested, we went for the Chef's special tasting menu and here's what all I would like to recommend -\n\n⭐ Mishti Doi Shots - Sweet curd condensed to form a thick jelly like texture which had to be gulped down at once! One of the most innovative welcome treats!\n\n⭐ Chai Paani - A vodka &amp; kahlua based cocktail infused with tea. It was a visual treat to watch this getting prepared! The taste was heavenly! It was served in a quirky kettle and I comfortably sipped this exotic cocktail throughout my meal!🔥🔥🔥\n\n⭐ Aaloo Bukhara Kale salad - Was next in line. Even though I am not a fan of Salads, the fresh and juicy Aaloo Bukhara along with Goat Chesse was irresistible!\n\n⭐ Masala Jackfruit Cigars with Tadka Mayo - Highly Recommended. Thin and super crispy sticks were made of Jackfruit and served with scrumptious Mayo which had been flavoured in house! 🔥🔥🔥\n\n⭐ Nizami Tarkari Biryani - All Biryani lovers, go for this one! You'll thank me later. Served with delicious Raita, it was the perfect main course of the day!🔥🔥\n\n⭐ Matka Cholle Lucchi Puff - The modern day Cholle Bhature! The puffs or Bhature were palm sized and thanks to their size, we could devour the entire portion! The Cholle were cooked to perfection! Balanced spices and full of flavour!🔥\n\n⭐ Desi Chowmein - Topped with crunchy and saucy dry Chatpati Sev! Innovation at it's peak!🔥\n\n⭐ Ratatoville Gujia - An appetizer in the form of a Gujiya stuffed with Italian filling. HIGHLY RECOMMEND! I could devour more than 20, if they would have served!🔥🔥🔥\n\n⭐ Dal Chawal Arancini - Another Wonder! Small round shaped balls were made out of Dal and Rice which were served with Papad! This dish hooked me to Farzi Cafe completely!🔥🔥🔥\n\n⭐ Chocolate Dirt Pile - We tasted the Ragi crispies but it was the Choco Dirt pile that stole the show! The key was to mess up the bowl as much as possible! 🔥🔥🔥\n\nWe were served a tangy lolipop after the Appetizers to clean our palate before the main course so that we could enjoy the best of both worlds!\n\nThe service was impeccable! The Chef served us all the dishes and explained the dietary benefits of everything, the method of preparation and the stewards were exceptionally attentive! The cafe was managed perfectly!\n\nDesi habshi highly recommends! ","reviewTime":"2018-05-22 00:21:13","reviewTimeFriendly":"21 days ago","timestamp":1526928673,"ratingColor":"305D02"},{"id":"35511011","userName":"Rajarshi Guha","rating":5,"rating_5":"5.0000","reviewText":"It is a great place to catch a quick lunch. The service is real quick and satisfactory. The Young Man Mr. Vishal who serviced us has a fantastic product knowledge and taken care of us nicely. Thanks Farzi Cafe team, If I ever visit Gurgaon, will surely have a bite there.","reviewTime":"2018-05-21 17:09:23","reviewTimeFriendly":"21 days ago","timestamp":1526902763,"ratingColor":"305D02"},{"id":"35495954","userName":"Akhil George","rating":5,"rating_5":"5.0000","reviewText":"5stars\n\nLoved everything about this place. Great food, amazing service, good ambience and lovely music.\n\nThe food was top notch, and quite amazed by the knowledge of the staff. The menu, being a fusion restaurant, is quite complicated and the boys did a great job explaining it and providing good recommendations. \n\nWe tried the Amritsari fish and chips, pani puri, chicken tikka masala and another veg starter (can&rsquo;t remember the name, but I have uploaded a pic). Everything was yum!\n\nDrinks - Order the Bang Bang cocktail, it  was kickass! If you like the flavor of passion fruit, this is a must try. ","reviewTime":"2018-05-20 23:01:37","reviewTimeFriendly":"22 days ago","timestamp":1526837497,"ratingColor":"305D02"},{"id":"35495688","userName":"Feed Eat","rating":4,"rating_5":"4.0000","reviewText":"Farzi cafe is sheer love... Love their fusion food ... They serve  different tastes in their meals which is appealing and is the best to eat..","reviewTime":"2018-05-20 22:56:32","reviewTimeFriendly":"22 days ago","timestamp":1526837192,"ratingColor":"5BA829"},{"id":"35491509","userName":"Akhilesh Sanmotra","rating":5,"rating_5":"5.0000","reviewText":"Tha cafe is awesome . Service is great . Moreover the hospitality is great . The drinks and the music just add greatness to the fun ........","reviewTime":"2018-05-20 21:38:02","reviewTimeFriendly":"22 days ago","timestamp":1526832482,"ratingColor":"305D02"},{"id":"35474334","userName":"DIVYA TAKYAR","rating":4,"rating_5":"4.0000","reviewText":"This is a fusion eatery and the ambience is quirky. They play peppy western hits from the 80's era and that adds to the fun. We had the Galouti kabab burger and it was delicious.Must visit if you want to try something different.","reviewTime":"2018-05-20 13:27:10","reviewTimeFriendly":"22 days ago","timestamp":1526803030,"ratingColor":"5BA829"},{"id":"35459815","userName":"Ravinder Chandhok","rating":5,"rating_5":"5.0000","reviewText":"Amazing service.food was awesome.mind blowing band.we were served by Roshan , Vishal Amit and sanjeev.would love to visit again and again.loved it","reviewTime":"2018-05-19 21:45:39","reviewTimeFriendly":"23 days ago","timestamp":1526746539,"ratingColor":"305D02"},{"id":"35457231","userName":"Ishitataneja11","rating":5,"rating_5":"5.0000","reviewText":"The place offers a very creative fusion of dishes. The galouti burgers, chicken tacos, parle g cheesecake are a must try. The presentation is interesting and creative. Staff is courteous. ","reviewTime":"2018-05-19 20:44:15","reviewTimeFriendly":"23 days ago","timestamp":1526742855,"ratingColor":"305D02"},{"id":"35426229","userName":"Ambika Narain","rating":3,"rating_5":"3.0000","reviewText":"Starters are to die for. Simply delicious.\nMain course was disappointing comparitively. Mutton dishes were undercooked. Vegetarian dishes and deserts (especially chocolate mud bowl) were disappointing.\nSpecial mention for all chicken dishes, tandoori soya chaap and Bailey's lollipops. They were absolutely marvellous. Ambience and service was quite good. Overall experience was good. But for vegetarians, better to fill your stomach with starters. They were much better than main course. Lollipops are the only desert worth trying. ","reviewTime":"2018-05-18 18:46:50","reviewTimeFriendly":"24 days ago","timestamp":1526649410,"ratingColor":"CDD614"},{"id":"35425521","userName":"Sanidhya Singh","rating":3,"rating_5":"3.0000","reviewText":"Got stones in my food. Not expected from Farzi. Being such a brand and being one of the expensive ones, it was not a good experience. Farzi has always been my first choice, but now it doesn't seem so. Although they apologized, by giving deserts for free, which were yummy. But when you visit such restaurants, you don't expect to get such experiences. Not sure to visit them again. Advice to management : Kindly make sure such events are not repeated. One such experience, you can loose your regular customers.","reviewTime":"2018-05-18 18:12:43","reviewTimeFriendly":"24 days ago","timestamp":1526647363,"ratingColor":"CDD614"},{"id":"35410638","userName":"Seema Tarun Sofat","rating":1,"rating_5":"1.0000","reviewText":"As the name stands It was truly farzi my frenz... Unfortunately i hosted  my son&rsquo;s first bday party and had booked the entire place for the 10 th of may 2018 evening ... their management made great promises ... gave a scanty menu and charged me humongous amount by telling me there is so much drama they will do with the food ... and the food will flow like we wouldn&rsquo;t  beable to handle it and that they at Farzi Cafe are experts at parties like these also adding that we Infact had a small number ( 80 people&nbsp; . Believe me guys each and every person gave me a terrible feedback .. how insulting it was for me you wouldn&rsquo;t believe .... neither did they serve the food n forget the drama ... they gave us quarter plates to have our dinner in with rubber like chapatis ... and to my horror they didn&rsquo;t even serve the birthday cake and stocked it up in their fridge ... don&rsquo;t even want to give it any star but had to write this for public so no one else gets fooled by Farzi Cafe and this very very unprofessional management","reviewTime":"2018-05-17 23:25:43","reviewTimeFriendly":"25 days ago","timestamp":1526579743,"ratingColor":"CB202D"},{"id":"35409264","userName":"Vaibhav Mishra","rating":5,"rating_5":"5.0000","reviewText":"I want too say one thing about ROHIT Excellent Service and The help while order Item from menu\n\nAt last Excellent Food and Services\n\nNow I love FARZI just because of ROHIT ","reviewTime":"2018-05-17 22:40:43","reviewTimeFriendly":"25 days ago","timestamp":1526577043,"ratingColor":"305D02"},{"id":"35394805","userName":"Keerthy Pethaiyan","rating":5,"rating_5":"5.0000","reviewText":"Execeptional food..! Lamb preparations were mind blowing..! Though the the quantity was less, the taste is worth the money...!! Must visit for meat lovers..!","reviewTime":"2018-05-17 13:11:30","reviewTimeFriendly":"25 days ago","timestamp":1526542890,"ratingColor":"305D02"},{"id":"35393772","userName":"Tushar","rating":5,"rating_5":"5.0000","reviewText":"Wow...is the most apat expression to begin the review for this place, Almost every dish has a wow factor. Having visited Farzi cafes in Bangalore and Mumbai I really wasnt expecting they would be able to surprise me here in Gurgaon but they did and how.\nThis place is all about Innovations in food and presentation. If you understand what flavours in a dish are and want to experience a rollercoaster ride in this culinary amusement world....this is a place to venture in.\n\nService: The service cannot get better and is nothing short of 5 star even though the place gets crowded. The staff is prompt and knows each and every dish very well. Subhod who served us along with the chef himself taking our orders ensured they explained each dish with the zeal its made.\n\nAmbience:\n\nVery elegantly done with an old and rustic feel. This place generally gets crowded with the IT crowd looking to unwind with colleagues so table booking is recommended even on weekdays. The DJ spins great english and occasional Hindi tracks. The volume is just right for one to have a conversation. So the field is well set for one to indulge in the culinary experience.\n\nCocktails:\n\nChuski Margarita: Margarita couldnt be better with amazing flavours of raw mango. To make you taste the flavours they present it with iced gola...couldnt get better.\n\nChai Pani: vodka and Kahlua based cocktail with tea infused in it. Tea connoisseur's must try.\n\nFood:\n\nYou are swept off your feet even before you start your meal with the welcome dish...we were served a unique version of Misti Doi.\n\nSoup: Cream Corn Chowder Bhutta wild greens. Amazing flavours and a must try.\n\nStarters:\nMushroom Falafel Donner. A must try for veggie lovers.\n\nChicken tikka cigars: Innovatively presented yet the flavours are amazingly induced.\n\nTandoori soy chops cheese and nut fudge: Another must try for veggie lovers and a local favourite.\n\nTahini cured country wings with tomato garlic chutney: Mildly flavoured and good for people who prefer less spice and pungent flavours.\n\nMains:\n\nMurg korma Biryani with peanut salan: chicken biryani very well flavoured with whole Indian spicies. Not oily and over flavoured....just the way it should be. The salan adds an extra touch of spiciness and can be added as per requirement.\n\nDesserts:\n\nWith so much food we really had to push ourselves for desserts but so glad we did.\n\nRas malai tres leches: A unique Rasmalai which is with Gajar Halwa and dipped in Safforn milk.\n\nParle G cheese cake: This one makes you rather nostalgic when you look at the Parle G biscuits and the cheese cake sandwiched between them. Rabri is the sauce its dipped in and leads to explosion of flavours.\n\n","reviewTime":"2018-05-17 12:13:32","reviewTimeFriendly":"25 days ago","timestamp":1526539412,"ratingColor":"305D02"},{"id":"35350864","userName":"Deepank Jain","rating":5,"rating_5":"5.0000","reviewText":"Worth every penny spent.Wow,realy it was different.vishal who was on our table was very helpfull in chosing dishes as it was Our first time.kudos to him.\n\n","reviewTime":"2018-05-15 14:14:42","reviewTimeFriendly":"27 days ago","timestamp":1526373882,"ratingColor":"305D02"},{"id":"35315796","userName":"Sameer Gupta","rating":4,"rating_5":"4.0000","reviewText":"Farzi Cafe won&rsquo;t let you down, definitely have to try it once for the Papdi chaat. Also, it has a wonderful presentation for food. Filling and tasty. Infact, main course is a formality. Appetisers is enough to fill you. The interiors are very nice. The service is excellent. I think the only drawback is that their meals are too filling. Too heavy on the heart. I think they could do well to reduce the quantities served. Nice place. ","reviewTime":"2018-05-13 22:35:54","reviewTimeFriendly":"29 days ago","timestamp":1526231154,"ratingColor":"5BA829"},{"id":"35271660","userName":"Minijha0","rating":5,"rating_5":"5.0000","reviewText":"Had a very nice time with freinds at farzi cafe,cyber hub.the drinks especially the strawberry lime was awesome.starters and main course were perfect.and full marks to the courteous staff especially Rahul who went out of the way to see that we were comfortable .a big thumbs up to farzi cafe ,cyber hub👍👍👍","reviewTime":"2018-05-12 17:16:23","reviewTimeFriendly":"30 days ago","timestamp":1526125583,"ratingColor":"305D02"},{"id":"35254258","userName":"Amil Bansal","rating":5,"rating_5":"5.0000","reviewText":"Amazing food and presentation. The service was quite good . Our server Rohit helped us choose the best options in veg food. \nThe ambience and music were good.","reviewTime":"2018-05-11 22:59:56","reviewTimeFriendly":"one month ago","timestamp":1526059796,"ratingColor":"305D02"},{"id":"35220283","userName":"Rohit Choudhary","rating":5,"rating_5":"5.0000","reviewText":"Awasome place. Loved it.food was lovely and staff were so polite with nice observing power.our table was taken care by Rohit and Vishal .would love to visit again","reviewTime":"2018-05-10 17:07:44","reviewTimeFriendly":"one month ago","timestamp":1525952264,"ratingColor":"305D02"},{"id":"35217162","userName":"Raj ₹@j Singh","rating":5,"rating_5":"5.0000","reviewText":"Great food, osm service by Rohit , the food serving is very different, great ambition,and the great thanks to Rohit..... All staff is very helpful,i had great time in farzi Cafe....","reviewTime":"2018-05-10 13:20:04","reviewTimeFriendly":"one month ago","timestamp":1525938604,"ratingColor":"305D02"},{"id":"35188518","userName":"Mokshya Patil","rating":5,"rating_5":"5.0000","reviewText":"A good place to experience and enjoy the innovative ways of presenting simple food. Ambiance of the place is charming, with good music, It is not a perfect place if you are there only in search of some great taste, but the innovation has its own value. Must visit, if you love innovations.","reviewTime":"2018-05-08 23:51:27","reviewTimeFriendly":"one month ago","timestamp":1525803687,"ratingColor":"305D02"},{"id":"35171457","userName":"Sanjay Vatsa","rating":4,"rating_5":"4.0000","reviewText":"Cafe ho to Farzi :) Heard a lot about its farziness, and found yes it is totally farzi. khaana farzi, presentation farzi, log bhi farzi.... But I really liked Farzi.. Ek visit to bunta hai...","reviewTime":"2018-05-08 10:15:12","reviewTimeFriendly":"one month ago","timestamp":1525754712,"ratingColor":"5BA829"},{"id":"35119541","userName":"Apoorv Anand Srivastava","rating":4,"rating_5":"4.0000","reviewText":"It there is one word that strikes my head every time I think of this restaurant, it is &ldquo;innovative&rdquo;. I remember when Farzi opened up in CP, it used to be &lsquo;the restaurant to try alternate desi&rsquo; and they still live up to that! A classic jazzy environment with wonderful food - always a delight to be here!  ","reviewTime":"2018-05-06 09:37:18","reviewTimeFriendly":"one month ago","timestamp":1525579638,"ratingColor":"5BA829"},{"id":"35108218","userName":"Lakshaya Soin","rating":5,"rating_5":"5.0000","reviewText":"Farzi is not your regular overpriced cyberhub restaurant.\nAnd by that I mean, it is probably overpriced. But it is in no way regular.\n\nEvery dish, every condiment, the service, The ambience. All of this comes together perfectly, and makes the restaurant one of the best in Cyberhub.\n\nSurprisingly enough, amid all the fancy food and amazing meats, the dish that I'd definitely go back for is their vada pav!\n\nApart from this, their tacos and the Malabar Tiffin were some exceptional dishes.\n\nThe food quality definitely makes up for whatever damage the bill does to your wallet! Definitely going there again.","reviewTime":"2018-05-05 20:34:00","reviewTimeFriendly":"one month ago","timestamp":1525532640,"ratingColor":"305D02"},{"id":"35085848","userName":"Diksha Agarwal","rating":4,"rating_5":"4.0000","reviewText":"This place offers awesome ambience and live band music. The service offered by roshan and amit was very well delivered.\nDo try their desi stuff. ","reviewTime":"2018-05-04 22:57:47","reviewTimeFriendly":"one month ago","timestamp":1525454867,"ratingColor":"5BA829"},{"id":"35080142","userName":"Pallavi Dubey","rating":1,"rating_5":"1.0000","reviewText":"Poor food and damn bad managers\n\nThe serving is too small but not even worth the taste\n\nIt's just a hype and needs to be avoided at all cost\n\nThe manager who came to our table didn't even apologized infact the same old saying I could hear it as I hear at thela walas &quot;humei toh ajtak kisi ne nh bola &quot;\n\nAnd they charge u ridiculous for such bad food ","reviewTime":"2018-05-04 20:25:23","reviewTimeFriendly":"one month ago","timestamp":1525445723,"ratingColor":"CB202D"},{"id":"35053686","userName":"Faraaz Siddiqui","rating":4,"rating_5":"4.0000","reviewText":"This place offers great ambience and a live music band on a weekend evening. Do try their desi offerings. Bit overpriced but then what is not in Cyberhub. ","reviewTime":"2018-05-03 18:36:15","reviewTimeFriendly":"one month ago","timestamp":1525352775,"ratingColor":"5BA829"},{"id":"35042478","userName":"Richa Garg","rating":4,"rating_5":"4.0000","reviewText":"Pros\n- Great Ambiance\n- Fast Service\n- Different style of presentation and recreation of food\n\nCons\n- I didn't like the every dish i ordered so value for money 4\/5\n\nOrdered\n- Pav bhaji 4\/5\n- Burger 3.5\/5\n- Dal chawal arancini 5\/5\nDal chawal arancini&nbsp; was a pleasant surprise.\nI liked the welcome by misthi doi shots\n\nIt was decent i would say and would like to try new dishes in the next visit.","reviewTime":"2018-05-03 04:04:48","reviewTimeFriendly":"one month ago","timestamp":1525300488,"ratingColor":"5BA829"},{"id":"35038502","userName":"Rahul Chaudhary","rating":5,"rating_5":"5.0000","reviewText":"Excellent food. Great atmosphere and service. Do ask for Rohit when you get there. Great personality with knowledge of what he does. Keep up the good work Rohit!","reviewTime":"2018-05-02 22:55:43","reviewTimeFriendly":"one month ago","timestamp":1525281943,"ratingColor":"305D02"},{"id":"35038012","userName":"Resonance2000009","rating":5,"rating_5":"5.0000","reviewText":"A wonderful place to chill out with variety of drinks backed up with a wonderful music...in short itz a place to b with your loved ones..not to mention the special one...\n\nfood\n\nI found chicken guntur and chicken cheettinand to b worth to b tasted by non veggies...\n\nall this above if u get a host like Roshan..cheerful friendly guy...u wil fynd him at the bar.... ","reviewTime":"2018-05-02 22:41:44","reviewTimeFriendly":"one month ago","timestamp":1525281104,"ratingColor":"305D02"},{"id":"35034966","userName":"Kitchen Affair","rating":5,"rating_5":"5.0000","reviewText":"This cafe always surprise you with there menu and I am always excited to try der new menu,\n\nNever disappoint you beat food, service, taste and creativity\n\nWe asked the service boy is there anything new in menu, he server few dishs\n\nNamkeen Gujia\nChicken Afghani\n\nThis place certainly deserve to be visited.","reviewTime":"2018-05-02 21:16:29","reviewTimeFriendly":"one month ago","timestamp":1525275989,"ratingColor":"305D02"},{"id":"35032534","userName":"NeDa","rating":4,"rating_5":"4.0000","reviewText":"I liked the food, Although the portion is so less but still i liked it as garnishing , taste and also the circumstance are interesting.&nbsp;\nCrowd was there at the time that we went there .","reviewTime":"2018-05-02 19:45:30","reviewTimeFriendly":"one month ago","timestamp":1525270530,"ratingColor":"5BA829"},{"id":"35021121","userName":"Maneesh Gupta","rating":5,"rating_5":"4.5000","reviewText":"Always love visiting this place. Quality of food, taste and presentation is always amazing and different from traditional ones. As name suggests Farzi - you would get each dish differently with same ingredients but totally in a different form. ","reviewTime":"2018-05-02 08:39:55","reviewTimeFriendly":"one month ago","timestamp":1525230595,"ratingColor":"3F7E00"},{"id":"34997499","userName":"Dillichatori ( Mansivchawla@gmail.com)","rating":5,"rating_5":"5.0000","reviewText":"Fusion food served at its best at Farzi cafe. Innovation dishes with great taste and amazing presentation. Chef Mahender guided us throughout the dining experience. He suggested us dishes as per our taste and liking. We started with soup and salad. Raw papaya salad was quite refreshing with tamarind flavor and fresh peanuts.&nbsp;\n\nStarters included mushroom chettinad gujjias which were the best dish for the entire meal. Mutton kebabs. murg tikka and chicken cigar rolls were yet another delicious dishes. For mocktails we tried Farzi ok which was orange based drink with basil leaves, other ones tried were passion fruit and italian smooch.&nbsp;\n\nMain course had two types of chicken gravy served with bread. Desserts included one chocolate dish with ice cream.&nbsp;\n\nWhile visiting do try the cocktails and chicken gujjia. They are just amazing. :)","reviewTime":"2018-05-01 11:53:08","reviewTimeFriendly":"one month ago","timestamp":1525155788,"ratingColor":"305D02"},{"id":"34992249","userName":"Ravi Gupta","rating":4,"rating_5":"3.5000","reviewText":"Over-hyped place - innovative menu but taste is quite average - not for repeat visit definitely. Kadhi Pakora was served in a fancy plate - but contents were cold - so it was obviously reheated.","reviewTime":"2018-05-01 00:43:41","reviewTimeFriendly":"one month ago","timestamp":1525115621,"ratingColor":"9ACD32"},{"id":"34989003","userName":"Jaya","rating":5,"rating_5":"5.0000","reviewText":"Farzi Cafe, a venture by Zorawar Kalra to bring out the fusion food has astounded me pleasantly. Recently had dinner at Farzi Cafe and was presented with their welcome drink 'misti doi'.\n\nOrdered for a litchi and orange base mocktail. I had quite a spread and am not really able to pick out my favourite. What I loved the most includes - Lahori Chicken, Black Seasme Chicken Tikka, Lamb Seekh Kebab, Lal Mirch Parantha.\n\nTheir Salad which had kale, green apples with strawberry dressing is my absolute favourite. We ended the meal with Rasmalai and Mud Cake.\n\nA must visit place if you are looking for some fusion food and spending some quality time with your dear ones. ","reviewTime":"2018-04-30 23:23:03","reviewTimeFriendly":"one month ago","timestamp":1525110783,"ratingColor":"305D02"},{"id":"34987263","userName":"Beingdilliwaala","rating":5,"rating_5":"5.0000","reviewText":"Taking molecular gastronomy to a whole new level, Farzi Cafe has revolutionalised the way we eat food. Having been to the one in Connaught Place, we were quite aware that we are going to have an amazing time at farzi. \n\nThe Cyber Hub for that matter feels like an altogether different space and farzi is one of the gems of the place. \n\nWe started with cream corn chowder soup, which was really consistent and delicious. \nThe salad was the best we have ever had anywhere in the world with pineapple, raw mangoes, kamal kakdi and peanut for the crunch. It was masaledaar and full points for brilliant presentation. That is true for all the things at farzi. \nThen we had the chicken tikka with garlic Mayo. The chicken tikka was wrapped inside crunchy wonton rolls and the dip was amazing. \nThe veggie Chowmien had a differentiating factor with fried spicy noodles topped on the Chowmien. It was delightful. \nThe rototo gujia was a really beautiful Innovation with mix veggies filled inside the traditional gujia and it was a melt in mouth dish with sweet chutney on the side. \nThe baby Lamb Seekh kebab were well cooked and a bit on spice side. \nThe dahi murgh was creamy and was quite flavourful and the mirchi paratha accompanied it. \nRasmalai gajar ka halwa with rose petals was another brilliant Innovation and had become our favourite Dessert. \n\nFarzi is by far one of the best places in the country to dine in with perfect service food and a wholesome experience. ","reviewTime":"2018-04-30 22:43:36","reviewTimeFriendly":"one month ago","timestamp":1525108416,"ratingColor":"305D02"},{"id":"34987244","userName":"The High Street","rating":4,"rating_5":"3.5000","reviewText":"As a name suggests Farzi, their dishes are full of different names but with those traditional indian dishes. Recently went with my family to try this place in cyber hub. after a long wait in que, we finally got a table. But we really like the ambiance. the music collection was also at point. But the innovative names of dishes somewhat disappointed us. We went with lot of expectations. The only Thing i like their was their desserts.","reviewTime":"2018-04-30 22:43:12","reviewTimeFriendly":"one month ago","timestamp":1525108392,"ratingColor":"9ACD32"},{"id":"34986154","userName":"Sassy N","rating":3,"rating_5":"3.0000","reviewText":"Recently visited This cafe in cyber hub with cunch of my friends. Heard lot about thi place. we really liked the ambiance and live music. Out of those all innovative names given to all traditional indian dishes, we tried Ratatouli gunjiya. and chicken tikka cigar. they were good in taste but not worth a price. Also we ordered for bailieys lolipoop (chocolate on the sticks with alcohol). they were worth a try, tasted amazing. overall nice experince, but food could have been better.","reviewTime":"2018-04-30 22:17:44","reviewTimeFriendly":"one month ago","timestamp":1525106864,"ratingColor":"CDD614"},{"id":"34982673","userName":"Lifestyle Syndrome","rating":3,"rating_5":"3.0000","reviewText":"The place is poorly lit at day time. Some part is too lit and other part is sunken in darkness. The menu has fusion items- different from the basics.\n&nbsp;Virgin Mojito was nice, refreshing and tangy.&nbsp;\nThai curry paneer tikka was tasty. Served with a dip, had a variety of flavours.\nDesi chowmein was  below average and misleading with the name.\nNazami Tarkari Biryani was served with a tiny portion of concentrated raita mixed with vegetables Had zucchini and other exotic vegetables, taking the taste away from authentic biryanis.&nbsp;\nBailey&rsquo;s Lollipop was small lollipops, having a little liquor, tastes like choco bar and a expensive according to the quantity.\nWe dont recommend this outlet much.","reviewTime":"2018-04-30 20:41:30","reviewTimeFriendly":"one month ago","timestamp":1525101090,"ratingColor":"CDD614"},{"id":"34982483","userName":"Motu Patlu","rating":4,"rating_5":"3.5000","reviewText":"Farzi Cafe which has its many outlets in delhi ncr and they serve modern indian dishes. their ambaince is good so as the live music. there is always a long que and waiting list in their cyber hub outlet. As they serve moder dishes. I had a high hope. but they played alot with the indian dishes and which killed the autheticity of the spices and flavors. I tried.&nbsp;Chicken tikka cigar which was basic and nothing unique wa stheir in it.","reviewTime":"2018-04-30 20:35:04","reviewTimeFriendly":"one month ago","timestamp":1525100704,"ratingColor":"9ACD32"},{"id":"34981934","userName":"The Food Theory","rating":3,"rating_5":"3.0000","reviewText":"Serving modern Indian cuisine is a trick for any restaurant. As people know the exact taste from their childhood and donot love to loose them. With farzi cafe, I recently tried their multiple dishes and I would say they are superb with their presenattion skills. but when it comes to the taste, they kept me leave disappointed. They played lot with the dishes and the authenticity of the dishes was missing. othervise they they a perfect dinning area with live music. so give it a try, maybe they serve you better food.","reviewTime":"2018-04-30 20:16:45","reviewTimeFriendly":"one month ago","timestamp":1525099605,"ratingColor":"CDD614"},{"id":"34931323","userName":"Gaurav Lal","rating":1,"rating_5":"1.0000","reviewText":"Very bad experience, staff not at all helpful. Seating - was like sitting in Mumbai train. Why the F they let people in if they can&rsquo;t manage \n\nReally bad management and poor service ","reviewTime":"2018-04-28 22:22:34","reviewTimeFriendly":"one month ago","timestamp":1524934354,"ratingColor":"CB202D"},{"id":"34930121","userName":"Nikita Goel","rating":4,"rating_5":"4.0000","reviewText":"One should definitely visit this place at least once, to check out the ambience, the hospitality and of course the food. This place gives such warm vibes.&nbsp;\n\nI found the food to be average with respect to the price. But the presentation of each and every dish that was presented was superb. Also the first thing you get there is a flavoured yogurt appetizer that will definitely tempt you to eat more.","reviewTime":"2018-04-28 21:51:51","reviewTimeFriendly":"one month ago","timestamp":1524932511,"ratingColor":"5BA829"},{"id":"34893754","userName":"Vidit Malik","rating":4,"rating_5":"4.0000","reviewText":"Great place to hangout. Went there for trying fusion dishes and they don't disappoint in any area except quantity (is less) and pricing (is more relative to quantity served) match. Food quality is superb. Only catch is if you visit the place in a large group say more than 20, you will find very less space on table. Marked this place as must visit in Gurgaon.\nOnly improvement area to be considered seriously are veg gravy dishes : they all taste the same. Please correct this.","reviewTime":"2018-04-27 13:45:34","reviewTimeFriendly":"one month ago","timestamp":1524816934,"ratingColor":"5BA829"},{"id":"34891788","userName":"Talvinder Singh","rating":4,"rating_5":"4.0000","reviewText":"This place is one of my favorite when it comes to Modern Indian Cuisine. We tried a lot of things here all were perfect cooked and tasted well. Our server took extra care since we have 2 kids and there was nothing much on the menu for them, he made sure that he could get something made for them. ","reviewTime":"2018-04-27 11:47:41","reviewTimeFriendly":"one month ago","timestamp":1524809861,"ratingColor":"5BA829"},{"id":"34889331","userName":"Aniket1749","rating":4,"rating_5":"4.0000","reviewText":"I am fond of fusion food and this place keeps up to its reputation, with amazing service the place also offers great food. Have been here a few times generally don&rsquo;t repeat places. A must visit place and must try fried tempura prawns.","reviewTime":"2018-04-27 03:54:23","reviewTimeFriendly":"one month ago","timestamp":1524781463,"ratingColor":"5BA829"},{"id":"34847596","userName":"Jatin","rating":5,"rating_5":"5.0000","reviewText":"Simply the best.An altogather different prespective of serving and recreation of food.The drinks are also exceptional , particularly martini chuski. Loved the hospitality. Chef Santosh creation are a deconstruction of regular food items which are both excellent in taste and a visual pleasure. The service staff particularly Roshan suggestions with respect to drinks were spot on.Loved each and every drink he suggested.The knowledge of the service staff is a feather in the cap for the place it shows a high level of training to the staff to cater to the guests needs and taste.All in all a place you cannot miss and if you go once youll go again for sure.\nStarters .......Jack Fruit Cigars,Corn Chowder,Chetniyad Chicken Gujia\nMain Course....Luchhin Choley,Parda Biryani\nDesserts.... Rasmalai deconstructed and Crumbled brownie Mud Pie.\nWill be visiting soon again.","reviewTime":"2018-04-24 23:56:15","reviewTimeFriendly":"one month ago","timestamp":1524594375,"ratingColor":"305D02"},{"id":"34802271","userName":"Faiyaz Hawawala","rating":3,"rating_5":"3.0000","reviewText":"I had heard a lot about this place and wanted to go since long. But i was little disappointed with the food after visiting. The prawns and the couple of drinks we ordered were really yummy. But other things were not as expected from Farzi since i had gone with high expectation. Tried almost 10 dishes among 5 people. ","reviewTime":"2018-04-22 21:04:48","reviewTimeFriendly":"one month ago","timestamp":1524411288,"ratingColor":"CDD614"},{"id":"34780237","userName":"Prateek Singh","rating":5,"rating_5":"5.0000","reviewText":"great service by roshan vishal ajay amit and ssnjeev.we enjoyed very much.we had a great time.good food and ambience.and good band.we will come again and again.would love to visit again","reviewTime":"2018-04-22 00:02:41","reviewTimeFriendly":"one month ago","timestamp":1524335561,"ratingColor":"305D02"},{"id":"34763816","userName":"Surbhi Arya","rating":3,"rating_5":"3.0000","reviewText":"The place is good.. quite a different style of presentation and fusion to dishes. \nI ordered for desi chowmein, matka chole and poori, tandoori paneer, strawberry lemonade and quite few more things. \nMost of the dished were good in taste, only thing that disappoints is the quantity of the dishes and their description on the menu, you will think of something and entirely a different thing will appear on your plate. \nReducing one point just for the quantity, you will never feel full as per the portion size they serve and seeing the portion the place will appear out to be a bit pricey.","reviewTime":"2018-04-21 14:11:20","reviewTimeFriendly":"one month ago","timestamp":1524300080,"ratingColor":"CDD614"},{"id":"34748929","userName":"Anushka","rating":3,"rating_5":"3.0000","reviewText":"Farzi stays true to it&rsquo;s name by offering everything fusion. Totally farzified by the concept!\n\nI was welcomed with amuze bouch&eacute;e, which is incredibly tasty combo of mishti doi.\n\n&bull; Thai curry paneer tikka: spicy paneer alongside a dip. It was too spicy so the taste was getting neutralised.\n&bull; Desi chowmein: it was not so desi, still was quite yum.\n&bull; Nizami tarkari biryani: from the presentation to taste everything was on point. It came alongside a small bowl of raita.\n&bull; Bailley&rsquo;s lollipop: little chocolate balls on a stick with a bit of alcohol mixed. A light dessert to end the meal with.\n&bull; Mojito: too tangy, couldn&rsquo;t even finish a glass.\n\nFull marks for presentation, but the taste can be improvised upon.","reviewTime":"2018-04-20 19:37:44","reviewTimeFriendly":"one month ago","timestamp":1524233264,"ratingColor":"CDD614"},{"id":"34741758","userName":"Harsha","rating":5,"rating_5":"4.5000","reviewText":"Well honestly i hate driving, esp when it is all the way to gurgaon. But this place made the effort totally worth it.\n\nTheir welcome drink is amuse bouche. Its yogurt based, really amazing.\nWe started with litchi panna desire, its a very refreshing drink esp if you love the flavour of aam panna. Also Farzi Ok was a good concoction which is a must have for a refreshing feel.\n\nFor starters do try the cigar rolls. Quite a different dish. Well honestly i will have go agree they get full marks for innovation. Do try their aloo gujiya. Yes, this is your gujiya with aloo stuffing. Also their chaap is quite good.\n\nFor main course we had the pav bhaji. They were  good both on the eyes and the palate. I loved their biryani. It was quite delectable. Also had a great presentation.\n\nFor dessert we tried their rasmalai. The ras of the rasmalai was to die for. Also the chef has tried something different with different layers in it.And he is quite successful.\nI would totally recommend this place.","reviewTime":"2018-04-20 13:20:56","reviewTimeFriendly":"one month ago","timestamp":1524210656,"ratingColor":"3F7E00"},{"id":"34734594","userName":"Chauhan Reviews","rating":5,"rating_5":"4.5000","reviewText":"Cyber hub is the best option in Gurgaon when it comes to food. I was with my friends and we went to Farzi Cafe. It was a very different and awesome experience.\n\nWe started with farzi special drink which was an orange based drink. It was very refreshing. In food, aloo gujiya was ultimate and came in a paper bag along with lays and a dip. Loved it. There were Mushrooms too stuffed with paneer. Very desi in taste which is a positive point.\n\nIn mains, we had Veg Biryani which was filled with Broccoli and Zucchini but the Taste was just supreme. We ended with Rasmalai that was super sweet and heavy. It is more than enough for two people. High Quality and high in taste too. Give this place a try for sure. You will love it like I did.\n","reviewTime":"2018-04-19 22:44:54","reviewTimeFriendly":"one month ago","timestamp":1524158094,"ratingColor":"3F7E00"},{"id":"34729430","userName":"Meenal Agrawal","rating":4,"rating_5":"4.0000","reviewText":"I was waiting to go to this place since a long time and then finally the overall experience was a happy one.\nI loved the courteous staff and the welcome drinks and the pan in the end. That actually makes you feel special.\nApart from that must try starter is:\nPaneer masala salad with nachos, a different appetizer that I have had in a very long time and a pleasant distraction from the regular monotonous starters that you are forced to order.\n\nMains: Veg Biryani\nLoved it. Amazing taste. Must try for all the veg lovers.\n\nWould love to visit again and try more. ","reviewTime":"2018-04-19 18:57:24","reviewTimeFriendly":"one month ago","timestamp":1524144444,"ratingColor":"5BA829"},{"id":"34712951","userName":"Kavya Singh","rating":3,"rating_5":"3.0000","reviewText":"My experience of Farzi cafe was average. It was not so good as i have heard a lot about its popularity. Service was fine. I liked the welcome by Mishti Dono shots. I ordered Burger and Chicken Changezi Quasadillas. It was a good fusion of Mexican and Indian food. Menu is no doubt interesting. Will visit again in the hope of an amazing experience. ","reviewTime":"2018-04-18 20:59:41","reviewTimeFriendly":"one month ago","timestamp":1524065381,"ratingColor":"CDD614"},{"id":"34703550","userName":"Nishi Tilara","rating":5,"rating_5":"5.0000","reviewText":"Farzi Cafe was on my list for a long time now. Finally got a chance to visit the same, and happy to do so. Loved the place to the core: the ambiance, service, food, drinks. You name it and I loved it.\n\nAlso a special mention about their cocktails. Must try and not to be missed, loved their smoothness and presentation. And the USP of the place is the food presentation, simple yet innovative.\n\nWhat I had!\n\nCorn Soup: a thick soup which was tangy and spicy. Also quite filling...Recommended\nGreen Papaya and Mango Salad: a refreshing take on salads. Fresh and yummy raw mango and payaya, topped with spices...Recommended\nTempura Fried Prawn: Prawns are love and these babies were crispy and saucy...Recommended\nRatatouli Gujiya: Guijiya shaped filled with veggies, a nice option for the vegetarians to have.\nChilli Chicken: Basic dish, can be tried and enjoyed\nChicken Tikka Cigar: The chicken cigars were delish, crispy thin coating with spicy chicken filling\nMatar Chole: Presented so well, this simple dish served with puri\/bhature\nDum Dahi Murg: A nice, less spicy version in north indian main course. Had it with Lal Mirch Parantha\nDirt Pile: true to its name, seriously looked with dirt, but the chocolate was delicious mixed with a huge quantity of chocolate sauce.\n\nCockTail:\nChuski Margarita: Tequila+Aam panna+Chuski\nFarzi Apple Foamintini: Vodka+ Mint Foam\nChai Paani: Vodka+ Kahula+ tea dedoction+fumes","reviewTime":"2018-04-18 12:50:43","reviewTimeFriendly":"one month ago","timestamp":1524036043,"ratingColor":"305D02"},{"id":"34699878","userName":"Sujan Bhatta","rating":5,"rating_5":"5.0000","reviewText":"Wow wow I wonder to be here what a place ambience and entertainment environment with enthusiasm service and d.m ha ha dirty mind((( uff Deepak mishra ))))he is fabulous and most entertaining person what a lovely environment over here drink was good and food presentation and taste wise brilliant wow Farzi Cafe wanna come on again and again with family and friends such a lovely 😊 hospitality wow keep it up guys 👍👍👍👍👍","reviewTime":"2018-04-18 01:38:55","reviewTimeFriendly":"one month ago","timestamp":1523995735,"ratingColor":"305D02"},{"id":"34698669","userName":"Swati Sradhanjali","rating":5,"rating_5":"5.0000","reviewText":"Cyberhub is one of the best places for foodies. Some of the best restaurants are located there and Farzi is definitely one of the very best. I had some unique delicious dishes there. The corn soup was damn good. I also had Lahori Chicken which was amazing. The Mezze Platter is definitely one of the things to try. In main course I had a mixed veg dish with Naan. For desserts, I had the Chocolate Dirt which is a unique dish and I liked it.","reviewTime":"2018-04-18 00:01:11","reviewTimeFriendly":"one month ago","timestamp":1523989871,"ratingColor":"305D02"},{"id":"34697266","userName":"Akash Saxena","rating":5,"rating_5":"5.0000","reviewText":"It was a pleasure celebrating my post birthday dinner at Farzi. We ordered Daal chawal and papad roll which was a delight. In addition to that, we requested Veg chaap rolls and Vada pao which were pretty good too. The highlight of the evening was the Cotton candy pans which made us mesmerized. A great place to visit.\nOne of favorite places when it comes to starters and drinks. Their dal chawal aracini and the buntas are my absolute favourite. However, will not really their maon course, which surprisingly they havent been able to manage.","reviewTime":"2018-04-17 22:55:56","reviewTimeFriendly":"one month ago","timestamp":1523985956,"ratingColor":"305D02"},{"id":"34694662","userName":"Richa Dhandhania","rating":4,"rating_5":"4.0000","reviewText":"I simply loved the place!!\n\nThey serve some unique delicacies in between meals which were quite nice.\n\nWe ordered a variety of starters. Dal chawal aranchini was the best. For the main course we ordered kofta and loved that as well.\n\nWe ended the meal by the delicious rabdi.\n\nOverall, very happy with the service , ambience and food! ","reviewTime":"2018-04-17 21:21:09","reviewTimeFriendly":"one month ago","timestamp":1523980269,"ratingColor":"5BA829"},{"id":"34689756","userName":"Attreyee Paul","rating":5,"rating_5":"5.0000","reviewText":"Highly recommend! The restaurant was exceptional, not only because every meal we enjoyed had a variety of options and was flavorful but also because the prices were so reasonable ! If you are into &lsquo;desi food&rsquo; and enjoy innovative fusions, this is the place. The service was quick and efficient! They are a staunch believer of delivering the exact flavour of every meal and so they kept surprising us with different ways of cleaning the pallet. The only disappointment was the music being played out loud.\nOverall- a fantastic food joint with great service , good food and spectacular twist to the regular desi food.","reviewTime":"2018-04-17 16:51:18","reviewTimeFriendly":"one month ago","timestamp":1523964078,"ratingColor":"305D02"},{"id":"34689334","userName":"Priya","rating":4,"rating_5":"4.0000","reviewText":"I love this place, last time i was go there with my friend neha, we both are enjoying their food very much, it is delicious and also an attractive place to eat with friends","reviewTime":"2018-04-17 16:24:59","reviewTimeFriendly":"one month ago","timestamp":1523962499,"ratingColor":"5BA829"},{"id":"34680020","userName":"Alimpan De","rating":4,"rating_5":"4.0000","reviewText":"if you are looking for innovation, this is the place. starting from service to food to decor everything is great. the desi type chowmein (noodles) was mind blowing and the soya chap had the best after taste. icing on the cake was the rasmalai. it was innovative, creative and the most delicious\n\none piece of advise: please keep the volume down. the place was not filled and you had loud music which was not really useful!","reviewTime":"2018-04-16 23:48:35","reviewTimeFriendly":"one month ago","timestamp":1523902715,"ratingColor":"5BA829"},{"id":"34673050","userName":"That Veggie Blogger","rating":5,"rating_5":"4.5000","reviewText":"There are different things which I keep in mind while going out. Whether it is an official work or a leisure time out or going to a relative&rsquo;s house, there are different things which I always check. One of the most important in that category is food. Food is something which is always my priority no matter what I do or where I go. If I am stepping out of my premises, there should be good food in place.\n\nThe same is the story of every weekend. Sunday arrives and I plan a meal, preferably Lunch. Sometimes, it is with friends and sometime with family. The only constant in the ever changing plans is food. Food is one part of my life which will always be on my side as long as I crave for it. This particular time, I planned my lunch in Gurgaon as I was visiting my friends there. \n\nTwo of the most famous areas for food in Gurgaon are &ndash; Sec 29 market and Cyber Hub. I have been to both of them numerous times and loved both of them equally. A choice was to be made between two of them and believe me when I say it wasn&rsquo;t an easy one. I finally decided on Cyber Hub as it is just next to a metro station. You just have to take a few steps from IndusInd metro station and you will enter Cyber Hub.\n\nThere are a lot of choices In Cyber Hub. If you want are looking for Breakfast, you can go select IHOP. If Chinese is in your Mind, then Yum Yum Cha is the place for you. For full on Indian food, there can nothing be better than Made In Punjab. I went with Farzi Caf&eacute;. It comes highly recommended from the makers of Made In Punjab. Their Desi food with a twist makes them a force to reckon with.\n\nComing to the restaurant, it is right next to Made In Punjab which is from the same family as mentioned above. They even have Punjab Grill Tappa present in Cyber Hub. I went there for Sunday lunch at around 2 and they were almost full. I was lucky to get a seat at that time. They have a respectable seating of around 80 people at once. They have a dedicated bar present and are quite famous for their alcoholic drinks.\n\nComing to food department, we were served Amuse Bouche which is a rarity to see in NCR. It was given to prepare us for the mean. In desi term, it was Mishti Doi presented in a grand manner. Then there was Stuffed Mushrooms, Paneer Bhurji Taco and Aloo Gujiya. The mushrooms were fair in quantity as well as quality. Aloo Gujiya came in Paper Bag along with some complimentary plain Salted Wafers and and Sweet Chili Dip. Recommended. \n\nIn Drinks, there was Farzi Ok, Litchi Panna Desire and Italian Smooch. I specifically asked the server to make it a bit sweet. Not only did he oblige, but also he bought separate sugar syrup in case I wanted to add more. Nice gesture I must say. Farzi Ok was Orange based and Litchi Panna Desire was the best of all. Highly Recommended.\n\nIn Mains, there was Veg Biryani, Matka Chole Lucchi Puff and Pav Bhaji. All of them were ordered so that our Desi cravings can be satiated. Matka Chole Lucchi Puff can be easily called as Chole Bhature. Chole came in a Matka and were topped with raw onions. Bhature were very less oily which was helpful. Highly Recommended. Veg Biryani has Zucchini and Broccoli inside and was served with Salan and was really delicious. Recommended. But Pav Bhaji can be improved. Bhaji was just ordinary.\n\nIn Desserts, there were many eye catching options such as Parle G Cheesecake and Chocolate Dirt Pile but unfortunately both of them were with Egg. I went ahead with the sole Eggless Option in the form of Ras Malai Tres Leches, It was a normal Ras Malai stuffed with Carrot Cream and loads of gravy of Thick sweetened Pista Milk which was one of the best I have head. Highly Recommended.\n\nOverall, Farzi Caf&eacute; is a top choice if you are looking for some desi food but with a touch of difference. The Chef is to be credited with all the winning combinations. Recommended.","reviewTime":"2018-04-16 18:35:04","reviewTimeFriendly":"one month ago","timestamp":1523883904,"ratingColor":"3F7E00"},{"id":"34622040","userName":"Aman","rating":5,"rating_5":"5.0000","reviewText":"No doubt best place forever....\n\nNever disappointed till time... I have tried almost 40 to 50 visit here. \nGood food best service and unforgettable moment :)","reviewTime":"2018-04-14 18:30:18","reviewTimeFriendly":"one month ago","timestamp":1523710818,"ratingColor":"305D02"},{"id":"34590993","userName":"Foodie Fork","rating":5,"rating_5":"5.0000","reviewText":"This amazing place has introduced new and amazing menu again and this time you will get to try out the knwon things in a farzified way.\n\nSo the Ambience of the place is very nice. Nice and huge Bar counter with apt sitting and perfectly made floor for Live performances. The quality of furniture that they have used is very nice and comfortable. Also the lighting gives you that classic pub feel.\n\nApart from the new Menu we had our favorite Mocktails i.e. Farzi OK (Orangle based) and Litchi Panna (Litchi and spices) which were perfectly made this time as well.\n\nThe new Menu had Paneer Bhurji Tacos: Had soft paneer cubes with red butter gravy on top a Methi thepla taco. Very tasty.\n\nMatka Chhole Luchhi Puff: Lucchi is fried bread popular in bengal. These were served with tangy preparation of Chhole inside earthern pot. Everything was cooked perfectly and spiced nicely.\n\nMutton Seekh: Looked like normal mutton seekh but was filled with drooling cheese in it. Amazing.\n\nDahi Murg: It had succulent pieces of soft chicken on bone in yello curd based gravy, It had a very different flavors and little tangyness.\n\nChhena nest with kesar milk: It looked like a bird's nest with ras malai as the eggs and served by puring rose petals and warm kesar milk on top of it. It was so yummy and good. Must try","reviewTime":"2018-04-13 11:31:29","reviewTimeFriendly":"one month ago","timestamp":1523599289,"ratingColor":"305D02"},{"id":"34590423","userName":"Beard Foodies","rating":5,"rating_5":"4.5000","reviewText":"farzi cafe cyber hub \n\nWith its branch in cp where we had great experiance, we thought of trying this brand again.\n\ngreat place to have some amazing food with your loved ones\n\nStarters:\n\n&nbsp;Aloo Bukhara Kale salad, which was fresh and had a great flavour.\n\n&nbsp;Chicken tikka, caramelized onion cigars, the taste of the chicken tikka was exielent, perfectly rolled in the cigars.\n\n&nbsp;Tempura Fried Prawns, the prawns were fresh and mixed with the great flavour of sauce.topped with chilli foam.\n\nMain Course:\n\nMatka Chhole Luchi Puff, small pooris with spicy chole and salad. great taste for veg option.\n\n&nbsp;Mutton Irachi with Malabar Paratha, mutton masala(boneless) served in kerela style malabar paratha\n\nDesserts:\n\nchocolate dirt pile, bowl full of grated chocolte with some dry fruits and chunks of jaggery with hot chocolate to pour on top and mix it well before eating.","reviewTime":"2018-04-13 10:16:22","reviewTimeFriendly":"one month ago","timestamp":1523594782,"ratingColor":"3F7E00"},{"id":"34585779","userName":"Vrinda Malik","rating":4,"rating_5":"4.0000","reviewText":"The menu here is a creative take on what are otherwise boring food items. Most people won&rsquo;t be able to make up their mind about what to order but mind me it won&rsquo;t matter. Everything is delicious. \nTo top it all they have out of the box presentation. \nRecommend the daal aranchini and orange drink.\nLook out for the welcome curd dish and the palate cleanser.","reviewTime":"2018-04-12 23:09:16","reviewTimeFriendly":"one month ago","timestamp":1523554756,"ratingColor":"5BA829"},{"id":"34580714","userName":"Prateek Jain","rating":5,"rating_5":"5.0000","reviewText":"Roshan is amazing ...three musketiers  is amazing ..ask roshan and amit for drinks ..place is amazing for food and drinks ..come with family and friends ","reviewTime":"2018-04-12 19:57:53","reviewTimeFriendly":"one month ago","timestamp":1523543273,"ratingColor":"305D02"},{"id":"34580680","userName":"Ankit Goyal","rating":5,"rating_5":"5.0000","reviewText":"Roshan is an amazing bartender and drinks are super cool .. bang bang and bantas ,what do ever recommended by him..Rohit is amazing in recommendations ","reviewTime":"2018-04-12 19:56:29","reviewTimeFriendly":"one month ago","timestamp":1523543189,"ratingColor":"305D02"}]
